Revit 2024 API
DocumentSavingEventArgs Class
 The event arguments used by the DocumentSaving event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class DocumentSavingEventArgs : RevitAPIPreDocEventArgs
Visual Basic
Public Class DocumentSavingEventArgs _
	Inherits RevitAPIPreDocEventArgs
Visual C++
public ref class DocumentSavingEventArgs : public RevitAPIPreDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.DocumentSavingEventArgs
See Also
DocumentSavingEventArgs Members
Autodesk.Revit.DB.Events Namespace